{-
  Напишите программу, решающую следующую задачу методом полного перебора:

     «Крестьянину нужно перевезти через реку волка, козу и капусту. Но лодка такова,
     что в ней может поместиться только крестьянин,  а с ним или один волк, или одна
     коза, или одна капуста.  Но если оставить волка с козой,  то волк съест козу, а
     если оставить  козу с капустой,  то коза  съест капусту.  Как перевёз свой груз
     крестьянин?»

  В качестве идеи для реализации используйте решение задачи о калотанской семье
  (kalotans-puzzle.hs). 
-}

main = undefined
